Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# PresetImportInvalidFile
source: This is not an importable preset JSON file.
ja_jp: インポート可能なプリセットJSONではありません。
zh_hans: 这不是可导入的预设 JSON 文件。
zh_hant: 這不是可導入的預設 JSON 檔案。

# AgentActivityThinkingStepFormat
source: Thinking (Step {0}/8)
ja_jp: 思考中 (ステップ {0}/8)
zh_hans: 思考（步骤{0}/8）
zh_hant: 思考（步驟{0}/8）

# AgentErrorTitle
source: Agent Error
ja_jp: Agent エラー
zh_hans: Agent 错误
zh_hant: Agent 錯誤

# AgentEmptyPrompt
source: Please enter a task for the Agent.
ja_jp: Agentに指示する作業を入力してください。
zh_hans: 请输入 Agent 的任务。
zh_hant: 請輸入 Agent 的任務。

# AgentActivityStarting
source: Starting
ja_jp: 開始中
zh_hans: 开始
zh_hant: 開始

# AgentActivityCollectingContext
source: Collecting context
ja_jp: コンテキスト収集中
zh_hans: 收集上下文
zh_hant: 收集上下文

# AgentActivityThinking
source: Thinking
ja_jp: 思考中
zh_hans: 思考
zh_hant: 思考

# AgentOutputPreparingTool
source: Preparing tool call
ja_jp: ツール呼び出し準備中
zh_hans: 准备工具调用
zh_hant: 準備工具調用

# AgentToolCallParseFailed
source: Failed to parse tool call, displaying raw response.
ja_jp: ツールの呼び出しを解析できませんでした。原文を表示します。
zh_hans: 无法解析工具调用，显示原始响应。
zh_hant: 無法解析工具調用，顯示原始響應。

# AgentToolCallFormatRetry
source: Could not parse the tool call, so the Agent is retrying the format.
ja_jp: ツール呼び出しを解析できなかったため、形式を再要求しています。
zh_hans: 无法解析工具调用，因此 Agent 正在重试格式。
zh_hant: 無法解析工具調用，因此 Agent 正在重試格式。

# AgentToolCallFormatRetryLimit
source: Tool call format errors repeated, so Agent execution was stopped. Please run the task again.
ja_jp: ツール呼び出し形式のエラーが繰り返されたため、Agentの実行を停止しました。タスクを再実行してください。
zh_hans: 工具调用格式重复出现错误，因此 Agent 执行被停止。请再次运行该任务。
zh_hant: 工具呼叫格式重複出現錯誤，因此 Agent 執行被停止。請再次運行該任務。

# AgentSkillNotCalledRetry
source: The model described the skill but did not call it. Retrying the tool call.
ja_jp: スキルを呼び出さず説明のみでした。ツール呼び出しを再試行します。
zh_hans: 该模型描述了该技能，但没有调用它。重试工具调用。
zh_hant: 該模型描述了該技能，但沒有呼叫它。重試工具呼叫。

# AgentActivityTruncatedRetry
source: Response was truncated; continuing.
ja_jp: 応答が途切れたため、続きを書きます。
zh_hans: 响应被截断；继续。
zh_hant: 響應被截斷；繼續。

# AgentActivityFinalAnswer
source: Final answer generated
ja_jp: 最終回答の作成完了
zh_hans: 最终答案生成
zh_hant: 最終答案生成

# AgentToolRunning
source: Running tool
ja_jp: ツール実行中
zh_hans: 运行工具
zh_hant: 運行工具

# AgentDuplicateFailedToolSkippedFormat
source: The same {0} tool call already failed, so it was not run again. Change the arguments or write the final answer from the current result.
ja_jp: 同じ {0} ツール呼び出しはすでに失敗しているため、再実行しませんでした。引数を変更するか、現在の結果をもとに最終回答を作成してください。
zh_hans: 相同的 {0} 工具调用已经失败，因此不再运行。更改参数或根据当前结果写出最终答案。
zh_hant: 相同的 {0} 工具呼叫已經失敗，因此不再運作。更改參數或根據目前結果寫出最終答案。

# AgentDuplicateToolSkipped
source: Skipped duplicate tool call
ja_jp: 重複したツール呼び出しをスキップ
zh_hans: 跳过重复的工具调用
zh_hant: 跳過重複的工具調用

# AgentDuplicateToolSkippedFormat
source: The same {0} tool call already succeeded, so it was not run again. Use the previous result; write the final answer if no necessary next step remains.
ja_jp: 同じ {0} ツール呼び出しはすでに成功しているため、再実行しませんでした。前回の結果を使用し、必要な次のステップがなければ最終回答を作成してください。
zh_hans: 相同的 {0} 工具调用已经成功，因此不再运行。使用之前的结果；如果没有必要的下一步，请写下最终答案。
zh_hant: 相同的 {0} 工具呼叫已經成功，因此不再運作。使用先前的結果；如果沒有必要的下一步，請寫下最終答案。

# AgentDuplicateToolReused
source: The same tool call already succeeded, so it was not run again. The cached result is provided again.
ja_jp: 同じツール呼び出しはすでに成功しているため、再実行しませんでした。キャッシュ済みの結果を再提示します。
zh_hans: 相同的工具调用已经成功，因此不再运行。再次提供缓存的结果。
zh_hant: 相同的工具呼叫已經成功，因此不再運作。再次提供緩存的結果。

# AgentLoopGuardStopped
source: A repeated identical tool-call loop was detected, so Agent execution was stopped. Review the output and run the task again.
ja_jp: 同じツール呼び出しの繰り返しループを検出したため、Agentの実行を停止しました。出力を確認してから再実行してください。
zh_hans: 检测到重复的相同工具调用循环，因此 Agent 执行停止。检查输出并再次运行任务。
zh_hant: 偵測到重複的相同工具呼叫循環，因此 Agent 執行停止。檢查輸出並再次執行任務。

# AgentSelectedRangeEditComplete
source: Applied the selected range change.
ja_jp: 選択範囲の変更を適用しました。
zh_hans: 应用选定的范围更改。
zh_hant: 應用選定的範圍變更。

# AgentActivityDuplicateToolSkippedFormat
source: Skipped duplicate tool call: {0}
ja_jp: 重複したツール呼び出しをスキップ: {0}
zh_hans: 跳过重复的工具调用：{0}
zh_hant: 跳過重複的工具呼叫：{0}

# AgentActivityToolDoneFormat
source: Tool completed
ja_jp: ツール完了
zh_hans: 工具执行完成
zh_hant: 工具執行完成

# AgentActivityToolCancelled
source: Tool execution cancelled
ja_jp: ツールの実行がキャンセルされました
zh_hans: 工具执行已取消
zh_hant: 工具執行已取消

# AgentActivityToolFailedFormat
source: Tool failed: {0}
ja_jp: ツール失敗: {0}
zh_hans: 工具失败：{0}
zh_hant: 工具失敗：{0}

# AgentActivityStopRequested
source: Stop requested
ja_jp: 中止が要求されました
zh_hans: 请求停止
zh_hant: 請求停止

# AgentOutputStopping
source: Stopping Agent execution...
ja_jp: Agentの実行を停止しています...
zh_hans: 正在停止 Agent 执行...
zh_hant: 正在停止 Agent 執行...

# AgentActivityStopped
source: Stopped
ja_jp: 停止
zh_hans: 已停止
zh_hant: 已停止

# AgentOutputStopped
source: Agent execution was stopped.
ja_jp: Agentの実行が停止されました。
zh_hans: Agent 执行已停止。
zh_hant: Agent 執行已停止。

# AgentExceptionFormat
source: An exception occurred during Agent execution: {0}
ja_jp: Agent実行中に例外が発生しました: {0}
zh_hans: Agent执行期间发生异常：{0}
zh_hant: Agent執行期間發生異常：{0}

# AgentModeRun
source: Run
ja_jp: 実行
zh_hans: 运行
zh_hant: 運行

# AgentLanguageCode
source: en-US
ja_jp: ja-JP
zh_hans: zh-Hans
zh_hant: zh-Hant

# AgentActivityListFilesFormat
source: Listing files: {0}
ja_jp: ファイル一覧の取得中: {0}
zh_hans: 列表文件：{0}
zh_hant: 列表檔：{0}

# AgentActivitySearchTextFormat
source: Searching text: {0}
ja_jp: テキスト検索中: {0}
zh_hans: 搜索文字：{0}
zh_hant: 搜尋文字：{0}

# AgentActivityRunRgFormat
source: Running rg: {0}
ja_jp: rg実行中: {0}
zh_hans: 运行 rg：{0}
zh_hant: 運行 rg：{0}

# AgentActivityRunRgaFormat
source: Running rga: {0}
ja_jp: rga実行中: {0}
zh_hans: 运行 rga：{0}
zh_hant: 運行 rga：{0}

# AgentActivityRunPdftotextFormat
source: Running pdftotext: {0}
ja_jp: pdftotext実行中: {0}
zh_hans: 运行 pdftotext: {0}
zh_hant: 運行 pdftotext: {0}

# AgentActivityRunPowerShellFormat
source: Running PowerShell: {0}
ja_jp: PowerShell実行중: {0}
zh_hans: 运行 PowerShell：{0}
zh_hant: 運行 PowerShell：{0}

# AgentActivityReadFileFormat
source: Reading file: {0} (lines {1} to {2})
ja_jp: ファイルの読み込み中: {0} ({1}行目から{2}行目)
zh_hans: 读取文件：{0}（行{1}到{2}）
zh_hant: 讀取檔案：{0}（行{1}到{2}）

# AgentActivitySkillUseFormat
source: Referencing skill: {0}
ja_jp: スキルを参照中: {0}
zh_hans: 参考技能：{0}
zh_hant: 參考技能：{0}

# AgentActivityCreateFileFormat
source: Creating file: {0}
ja_jp: ファイルの作成中: {0}
zh_hans: 创建文件：{0}
zh_hant: 建立檔案：{0}

# AgentActivityReplaceFileFormat
source: Modifying file: {0}
ja_jp: ファイルの修正中: {0}
zh_hans: 修改文件：{0}
zh_hant: 修改文件：{0}

# AgentActivityReplaceRangeFormat
source: Replacing range in file: {0} (lines {1} to {2})
ja_jp: ファイルの範囲を修正中: {0} ({1}行目から{2}行目)
zh_hans: 替换文件中的范围：{0}（行 {1} 到 {2}）
zh_hant: 替換檔案中的範圍：{0}（行 {1} 到 {2}）

# AgentActivityInsertIntoFileFormat
source: Inserting into file: {0}
ja_jp: ファイルに挿入中: {0}
zh_hans: 插入文件：{0}
zh_hant: 插入檔案：{0}

# AgentActivityApplyPatchFormat
source: Applying patch to file: {0}
ja_jp: ファイルにパッチを適用中: {0}
zh_hans: 将补丁应用到文件：{0}
zh_hant: 將補丁套用到檔案：{0}

# AgentActivityOverwriteFileFormat
source: Overwriting file: {0}
ja_jp: ファイルの上書き中: {0}
zh_hans: 覆盖文件：{0}
zh_hant: 覆蓋檔案：{0}

# AgentActivityAppendFileFormat
source: Appending to file: {0}
ja_jp: ファイルに追加中: {0}
zh_hans: 附加到文件：{0}
zh_hant: 附加到檔案：{0}

# AgentActivityMergeFilesFormat
source: Merging files: {0}
ja_jp: ファイルを結合中: {0}
zh_hans: 合并文件：{0}
zh_hant: 合併文件：{0}

# AgentActivitySplitFileFormat
source: Splitting file: {0}
ja_jp: ファイルを分割中: {0}
zh_hans: 分割文件：{0}
zh_hant: 分割檔：{0}

# AgentActivityInsertText
source: Inserting into current editor
ja_jp: 現在のエディタに入力中
zh_hans: 插入到当前编辑器中
zh_hant: 插入到目前編輯器中

# AgentActivityCreateTabFormat
source: Inserting into new tab: {0}
ja_jp: 新しいタブに入力中: {0}
zh_hans: 插入新选项卡：{0}
zh_hant: 插入新分頁：{0}

# AgentActivitySaveTabFormat
source: Saving tab: {0}
ja_jp: タブを保存中: {0}
zh_hans: 保存选项卡：{0}
zh_hant: 儲存選項卡：{0}

# AgentActivityEditTabFormat
source: Editing tab: {0}
ja_jp: タブを編集中: {0}
zh_hans: 编辑选项卡：{0}
zh_hant: 編輯選項卡：{0}

# AgentActivityUnknownToolFormat
source: Running tool: {0}
ja_jp: ツール実行中: {0}
zh_hans: 运行工具：{0}
zh_hant: 運行工具：{0}

# AgentActivityDiffReviewFormat
source: Waiting for file change approval: {0}
ja_jp: ファイル変更の承認待ち: {0}
zh_hans: 等待文件更改批准：{0}
zh_hant: 等待文件更改批准：{0}

# AgentDiffDialogTitleFormat
source: Confirm Agent File Change: {0}
ja_jp: Agent ファイル変更の確認: {0}
zh_hans: 确认 Agent 文件更改：{0}
zh_hant: 確認 Agent 檔案變更：{0}

# AgentDiffApplyButton
source: Approve
ja_jp: 承認
zh_hans: 批准
zh_hant: 核准

# AgentDiffCancelButton
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# AgentActivityDiffAppliedFormat
source: File change approved: {0}
ja_jp: 変更適用の承認: {0}
zh_hans: 文件更改已批准：{0}
zh_hant: 文件更改已批准：{0}

# AgentActivityDiffCancelledFormat
source: File change cancelled: {0}
ja_jp: 変更適用のキャンセル: {0}
zh_hans: 文件更改已取消：{0}
zh_hant: 檔案變更已取消：{0}

# AgentActivityPlanApprovalPending
source: Waiting for plan execution approval
ja_jp: 計画実行の承認待ち
zh_hans: 等待计划执行批准
zh_hant: 等待計劃執行批准

# AgentPlanApprovalHeader
source: Approve Plan Execution
ja_jp: 計画実行の承認
zh_hans: 批准计划执行
zh_hant: 批准計劃執行

# AgentPlanApprovalDescriptionFormat
source: Review, edit, and save the opened plan, then approve to execute it in a new session. Plan: {0}
ja_jp: 開いた計画書を確認、編集、保存してから承認すると、新しいセッションで計画を実行します。 計画書: {0}
zh_hans: 查看、编辑并保存打开的计划，然后批准在新会话中执行它。 计划：{0}
zh_hant: 查看、編輯並儲存已開啟的計劃，然後批准在新會話中執行它。 計劃：{0}

# AgentActivityPlanApproved
source: Plan execution approved
ja_jp: 計画実行が承認されました
zh_hans: 计划执行获批准
zh_hant: 計劃執行獲批准

# AgentActivityPlanCancelled
source: Plan execution cancelled
ja_jp: 計画実行がキャンセルされました
zh_hans: 计划执行取消
zh_hant: 計劃執行取消

# AgentActivityPlanSavedFormat
source: Plan saved: {0}
ja_jp: 計画書を保存しました: {0}
zh_hans: 已保存计划：{0}
zh_hant: 已保存計畫：{0}

# AgentActivityMakePlan
source: Saving plan
ja_jp: 計画書を保存中
zh_hans: 储蓄计划
zh_hant: 儲蓄計劃

# AgentVerboseMakePlanOnly
source: Saved and opened the plan.
ja_jp: 計画書を保存して開きました。
zh_hans: 已保存并打开计划。
zh_hant: 已儲存並開啟計畫。

# AgentMakePlanRequired
source: Planning mode must save the plan with the make_plan tool.
ja_jp: 計画モードでは make_plan ツールで計画書を保存する必要があります。
zh_hans: 计划模式必须使用 make_plan 工具保存计划。
zh_hant: 計劃模式必須使用 make_plan 工具儲存計劃。

# AgentMakePlanRetryLimit
source: No make_plan tool call was produced, so planning mode stopped. Please run it again.
ja_jp: make_plan ツール呼び出しが生成されなかったため、計画モードを停止しました。もう一度実行してください。
zh_hans: 没有生成 make_plan 工具调用，因此计划模式停止。请再次运行。
zh_hant: 沒有產生 make_plan 工具調用，因此計劃模式停止。請再次運行。

# AgentPlanPathMissing
source: Could not find the saved plan path, so execution was not started.
ja_jp: 保存された計画書のパスが見つからなかったため、実行を開始しませんでした。
zh_hans: 找不到保存的计划路径，因此未开始执行。
zh_hant: 找不到已儲存的計劃路徑，因此未開始執行。

# AgentPlanSavedOutputFormat
source: Saved and opened the plan: {0}
ja_jp: 計画書を保存して開きました: {0}
zh_hans: 保存并打开计划：{0}
zh_hant: 儲存並開啟計劃：{0}

# AgentPlanOpenFailedFormat
source: Could not open the plan: {0}
ja_jp: 計画書を開けませんでした: {0}
zh_hans: 无法打开计划：{0}
zh_hant: 無法開啟計畫：{0}

# AgentPlanExecutionCancelledOutput
source: Plan execution was cancelled.
ja_jp: 計画実行はキャンセルされました。
zh_hans: 计划执行被取消。
zh_hant: 計劃執行被取消。

# AgentPlanSaveDirtyTabFailed
source: The edited plan tab could not be saved, so execution was not started.
ja_jp: 編集された計画タブを保存できなかったため、実行を開始しませんでした。
zh_hans: 无法保存编辑的计划选项卡，因此未开始执行。
zh_hant: 無法儲存編輯的計劃選項卡，因此未開始執行。

# AgentPlanSaveErrorTitle
source: Plan Save Error
ja_jp: 計画保存エラー
zh_hans: 计划保存错误
zh_hant: 計劃保存錯誤

# AgentPlanSaveErrorMessage
source: An error occurred while saving the plan: {0}
ja_jp: 計画書の保存中にエラーが発生しました: {0}
zh_hans: 保存计划时出错：{0}
zh_hant: 儲存計劃時發生錯誤：{0}

# AgentPlanExecutionSessionTitle
source: Execute Plan
ja_jp: 計画実行
zh_hans: 执行计划
zh_hant: 執行計劃

# AgentInsertTitle
source: Insert Agent Response
ja_jp: Agentの応答を入力
zh_hans: 插入 Agent 响应
zh_hant: 插入 Agent 響應

# AgentNoOutputToInsert
source: No Agent response to insert.
ja_jp: 入力するAgentの応答がありません。
zh_hans: 插入时没有 Agent 响应。
zh_hant: 插入時沒有 Agent 反應。

# AgentNoLastAnswerToInsert
source: No last Agent answer to insert in a new tab.
ja_jp: 新規タブに入力する最後のAgent回答がありません。
zh_hans: 没有最后一个 Agent 答案可插入新选项卡中。
zh_hant: 沒有最後一個 Agent 答案可插入新分頁。

# AgentNoActiveTab
source: No active tab
ja_jp: アクティブなタブなし
zh_hans: 没有活动选项卡
zh_hant: 沒有活動選項卡

# AgentNoSelection
source: No selection
ja_jp: 選択なし
zh_hans: 没有选择
zh_hant: 沒有選擇

# AgentSelectionStats
source: Selection {0:N0} chars
ja_jp: 選択 {0:N0}文字
zh_hans: 选择 {0:N0} 字符
zh_hant: 選擇 {0:N0} 字符

# AgentContextStatsFormat
source: Context: {0} · {1}
ja_jp: コンテキスト: {0} · {1}
zh_hans: 上下文：{0}·{1}
zh_hant: 上下文：{0}·{1}

# AgentGitWarning
source: Warning: Not a Git repository
ja_jp: 警告: Gitリポジトリではありません
zh_hans: 警告：不是 Git 存储库
zh_hant: 警告：不是 Git 儲存庫

# AgentGitRequired
source: The Agent can only be used in folders that are Git repositories.
ja_jp: AgentはGitリポジトリとして指定されたフォルダ内でのみ実行できます。
zh_hans: Agent 只能在属于 Git 存储库的文件夹中使用。
zh_hant: Agent 只能在屬於 Git 儲存庫的資料夾中使用。

# AgentNewSessionButton
source: New Session
ja_jp: 新規セッション
zh_hans: 新会议
zh_hant: 新會議

# AgentRewindSessionTooltip
source: Rewind to before the previous prompt
ja_jp: 前のプロンプト入力前まで巻き戻す
zh_hans: 回到上一个提示之前
zh_hant: 回到上一個提示前

# AgentCreateDialogTitle
source: Confirm Agent File Creation: {0}
ja_jp: Agent ファイル新規作成確認: {0}
zh_hans: 确认 Agent 文件创建：{0}
zh_hant: 確認 Agent 檔案建立：{0}

# AgentEditDialogTitle
source: Confirm Agent File Modification: {0}
ja_jp: Agent ファイル編集確認: {0}
zh_hans: 确认Agent 文件修改：{0}
zh_hant: 確認Agent 檔案修改：{0}

# AgentCreateSummaryFormat
source: Do you want to create this file? Path: {0}
ja_jp: ファイルを新規作成しますか？ パス: {0}
zh_hans: 您想创建这个文件吗？路径：{0}
zh_hant: 您想建立這個文件嗎？路徑：{0}

# AgentEditSummaryFormat
source: Do you want to modify this file? Path: {0}
ja_jp: ファイルを編集しますか？ パス: {0}
zh_hans: 您想修改这个文件吗？路径：{0}
zh_hant: 您想修改這個檔案嗎？路徑：{0}

# AgentOutputPlaceholder
source: Waiting... Enter a task for the Agent.
ja_jp: 待機中... Agentに指示する作業を入力してください。
zh_hans: 等待中... 请输入 Agent 任务。
zh_hant: 等待中... 請輸入 Agent 任務。

# AgentContextStatsDefault
source: Use active tab and selection as context
ja_jp: 現在のアクティブなタブと選択範囲をコンテキストとして使用します
zh_hans: 使用活动选项卡和选择作为上下文
zh_hant: 使用活動選項卡和選擇作為上下文

# AgentModelFormat
source: Model: {0} ({1})
ja_jp: モデル: {0} ({1})
zh_hans: 型号：{0}（{1}）
zh_hant: 型號：{0}（{1}）

# AgentIncludeActiveFile
source: Planning mode
ja_jp: 計画モード (Planning mode)
zh_hans: 规划模式
zh_hant: 規劃模式

# AgentPdfActiveTabExcluded
source: {0} (PDF excluded)
ja_jp: {0} (PDF 除外)
zh_hans: {0}（PDF 除外）
zh_hant: {0}（PDF 除外）

# AgentPromptPlaceholder
source: Enter task for Agent...
ja_jp: Agentに指示する作業を入力...
zh_hans: 输入 Agent 任务...
zh_hant: 輸入 Agent 任務...

# AgentRunButton
source: Run
ja_jp: 実行
zh_hans: 运行
zh_hant: 運行

# AgentStopButton
source: Stop
ja_jp: 中断
zh_hans: 停止
zh_hant: 停止

# AgentActivityHeader
source: Progress
ja_jp: 進行状況
zh_hans: 进展
zh_hant: 進展

# AgentActivityIdle
source: Idle
ja_jp: 待機中
zh_hans: 空闲
zh_hant: 閒置

# AgentInsertOutputTooltip
source: Insert Agent response at current cursor (Selected part only, if selected)
ja_jp: Agentの応答を現在のカーソル位置に入力します (選択された場合は選択部分のみ)
zh_hans: 在当前光标处插入 Agent 响应（仅限所选部分，如果选择）
zh_hant: 在目前遊標處插入 Agent 響應（僅限所選部分，如果選擇）

# AgentLastAnswerButtonText
source: Last Answer
ja_jp: 最後の回答
zh_hans: 最后的回答
zh_hant: 最後的回答

# AgentLastAnswerNewTabTooltip
source: Insert the last Agent answer in a new tab
ja_jp: 最後のAgent回答を新規タブに入力
zh_hans: 在新选项卡中插入最后一个 Agent 答案
zh_hant: 在新分頁中插入最後一個 Agent 答案

# AgentTokenCountFormat
source: {0:F1}k tokens
ja_jp: {0:F1}k トークン
zh_hans: {0:F1}k 代币
zh_hant: {0:F1}k 代幣

# AgentTokenCountWithLimitFormat
source: {0} / {1} tokens
ja_jp: {0} / {1} トークン
zh_hans: {0} / {1} 代币
zh_hant: {0} / {1} 代幣

# AgentInlineTokenCountFormat
source: {0:N0} tokens
ja_jp: {0:N0} トークン
zh_hans: {0:N0} 个 token
zh_hant: {0:N0} 個 token

# AgentLlmUsageWithCachedTokensFormat
source: LLM usage: input {0} / output {1} / total {2} / cached {3}
ja_jp: LLM使用量: 入力 {0} / 出力 {1} / 合計 {2} / cached {3}
zh_hans: LLM 用量：输入 {0} / 输出 {1} / 总计 {2} / cached {3}
zh_hant: LLM 用量：輸入 {0} / 輸出 {1} / 總計 {2} / cached {3}

# AgentLlmUsageFormat
source: LLM usage: input {0} / output {1} / total {2}
ja_jp: LLM使用量: 入力 {0} / 出力 {1} / 合計 {2}
zh_hans: LLM 用量：输入 {0} / 输出 {1} / 总计 {2}
zh_hant: LLM 用量：輸入 {0} / 輸出 {1} / 總計 {2}

# AgentUnknownTokenCount
source: unknown
ja_jp: 不明
zh_hans: 未知
zh_hant: 未知

# AgentAttachmentCountFormat
source: {0:N0} attachments
ja_jp: 添付 {0:N0}件
zh_hans: {0:N0} 个附件
zh_hant: {0:N0} 個附件

# AgentAttachmentCountSingularFormat
source: {0:N0} attachment
ja_jp: 添付 {0:N0}件
zh_hans: {0:N0} 个附件
zh_hant: {0:N0} 個附件

# AgentOutputPlaceholderKnownPrefixes
source: Waiting...
ja_jp: 待機中...
zh_hans: 等待中...
zh_hant: 等待中...

# AgentActivityIdleKnownValues
source: Idle
ja_jp: 待機中
zh_hans: 空闲
zh_hant: 閒置

# AgentDiffConfirmHeaderDefault
source: Confirm File Changes
ja_jp: ファイル変更の確認
zh_hans: 确认文件更改
zh_hant: 確認文件更改

# AgentDiffConfirmDescriptionDefault
source: Do you want to modify the file?
ja_jp: ファイルを修正しますか？
zh_hans: 您想修改该文件吗？
zh_hant: 您想修改該文件嗎？

# SettingsExaApiKey
source: Exa API Key (for web search)
ja_jp: Exa API Key (ウェブ検索用)
zh_hans: Exa API Key（用于网络搜索）
zh_hant: Exa API Key（用於網路搜尋）

# SettingsExaApiKeyPlaceholder
source: Enter Exa API Key (leave empty to delete)
ja_jp: Exa API Keyを入力 (空欄の場合は保存されたKeyを削除)
zh_hans: Enter Exa API Key（留空即可删除）
zh_hant: Enter Exa API Key（留空即可刪除）

# SettingsExaApiKeyInfo
source: The Exa API Key is used for the Agent's web search (Exa) function and is securely stored in the Windows Credential Manager.
ja_jp: Exa API KeyはAgentのウェブ検索(Exa)機能に使用され、Windows資格情報マネージャーに安全に保存されます。
zh_hans: Exa API Key 用于 Agent 的网络搜索 (Exa) 功能，并安全地存储在 Windows Credential Manager 中。
zh_hant: Exa API Key 用於 Agent 的網路搜尋 (Exa) 功能，並安全地儲存在 Windows Credential Manager 中。

# AgentActivityWebSearchExaFormat
source: Exa web searching: {0}
ja_jp: Exaウェブ検索中: {0}
zh_hans: Exa 网页搜索：{0}
zh_hant: Exa 網頁搜尋：{0}

# AgentActivityWebFetchFormat
source: Reading web page: {0}
ja_jp: ウェブページ読込中: {0}
zh_hans: 阅读网页：{0}
zh_hant: 閱讀網頁：{0}

# AgentActivityWebFetchExaFormat
source: Exa fetching web content: {0}
ja_jp: Exaウェブページ読込中: {0}
zh_hans: Exa 获取网页内容：{0}
zh_hant: Exa 取得網頁內容：{0}

# SettingsExaEndpoint
source: Exa Search API / MCP Endpoint
ja_jp: Exa 検索 API / MCP Endpoint
zh_hans: Exa 搜索 API / MCP 端点
zh_hant: Exa 搜尋 API / MCP 端點

# SettingsExaEndpointPlaceholder
source: e.g., https://mcp.exa.ai/mcp
ja_jp: 例: https://mcp.exa.ai/mcp
zh_hans: 例如，https://mcp.exa.ai/mcp
zh_hant: 例如，https://mcp.exa.ai/mcp

# AgentPowerShellConfirmHeader
source: PowerShell Execution Confirmation
ja_jp: PowerShell 実行の確認
zh_hans: PowerShell 执行确认
zh_hant: PowerShell 執行確認

# AgentPowerShellConfirmSummaryFormat
source: Do you want to run the following command? {0}
ja_jp: 以下のコマンドを実行しますか？ {0}
zh_hans: 您想运行以下命令吗？ {0}
zh_hant: 您想執行以下命令嗎？ {0}

# AgentActivityPowerShellConfirmationPending
source: Waiting for PowerShell execution approval
ja_jp: PowerShell 実行の承認待ち
zh_hans: 等待 PowerShell 执行批准
zh_hant: 等待 PowerShell 執行批准

# AgentActivityPowerShellApproved
source: PowerShell execution approved
ja_jp: PowerShell 実行が承認されました
zh_hans: PowerShell 执行批准
zh_hant: PowerShell 執行批准

# AgentActivityPowerShellCancelled
source: PowerShell execution cancelled
ja_jp: PowerShell 実行がキャンセルされました
zh_hans: PowerShell 执行已取消
zh_hant: PowerShell 執行已取消

# SettingsLlmAgentVerbose
source: Enable agent verbose output (Verbose)
ja_jp: Agentの詳細出力を有効にする (Verbose)
zh_hans: 启用 Agent 详细输出（Verbose）
zh_hant: 啟用 Agent 詳細輸出（Verbose）

# SettingsLlmAgentAutoApproveGitEdits
source: Auto-approve file changes/creation in Git folders
ja_jp: Gitフォルダー内でのファイル変更・作成を自動承認する
zh_hans: 自动批准 Git 文件夹内的文件更改/创建
zh_hant: 自動核准 Git 資料夾內的檔案變更/建立

# SettingsLlmAgentAutoApprovePowerShell
source: Auto-approve PowerShell except high-risk commands
zh_hans: 自动批准高风险命令以外的 PowerShell 命令
zh_hant: 自動核准高風險命令以外的 PowerShell 命令

# SettingsLlmAgentAutoApprovePlanning
source: Auto-approve plan execution (Planning mode)
ja_jp: 計画実行を自動承認する (Planningモード)
zh_hans: 自动批准计划执行
zh_hant: 自動核准計畫執行

# AgentVerboseReadFileOnly
source: Read file
ja_jp: ファイルを読み込みました
zh_hans: 已读取文件
zh_hant: 已讀取檔案

# AgentVerboseReadSkillOnly
source: Referencing skill: {0}
ja_jp: スキルを参照中: {0}
zh_hans: 已参考 {0} 技能。
zh_hant: 已參考 {0} 技能。

# AgentHtmlCodeBlockHidden
source: [HTML Code Block Hidden (Verbose Disabled)]
ja_jp: [HTML コードブロック非表示 (詳細出力が無効)]
zh_hans: [HTML 代码块隐藏 (Verbose Disabled)]
zh_hant: [HTML 程式碼區塊隱藏 (Verbose Disabled)]

# AgentVerboseAppendFileOnly
source: Appended content to file
ja_jp: ファイルに内容を追加しました
zh_hans: 已向文件追加内容
zh_hant: 已向檔案追加內容

# AgentVerboseSearchReplaceOnly
source: Completed search/replace
ja_jp: 検索/置換を完了しました
zh_hans: 已完成搜索/替换
zh_hant: 已完成搜尋/取代

# AgentVerboseMergeFilesOnly
source: Merged files
ja_jp: ファイルを結合しました
zh_hans: 已合并文件
zh_hant: 已合併檔案

# AgentVerboseSplitFileOnly
source: Split file
ja_jp: ファイルを分割しました
zh_hans: 已拆分文件
zh_hant: 已拆分檔案

# AgentVerboseListFilesOnly
source: Read directory
ja_jp: フォルダを読み込みました
zh_hans: 已读取文件夹
zh_hant: 已讀取資料夾

# AgentVerboseSearchTextOnly
source: Completed text search
ja_jp: テキスト検索を完了しました
zh_hans: 已完成文本搜索
zh_hant: 已完成文字搜尋

# AgentVerboseRunRgOnly
source: Completed Ripgrep search
ja_jp: Ripgrep 検索を完了しました
zh_hans: 已完成 Ripgrep 搜索
zh_hant: 已完成 Ripgrep 搜尋

# AgentVerboseRunRgaOnly
source: Completed Ripgrep All search
ja_jp: Ripgrep All 検索を完了しました
zh_hans: 已完成 Ripgrep All 搜索
zh_hant: 已完成 Ripgrep All 搜尋

# AgentVerboseRunPowerShellOnly
source: Completed PowerShell command
ja_jp: PowerShell コマンドを実行しました
zh_hans: 已执行 PowerShell 命令
zh_hant: 已執行 PowerShell 命令

# AgentVerboseRunPdftotextOnly
source: Completed pdftotext conversion
ja_jp: PdfToText 変換を完了しました
zh_hans: 已完成 PdfToText 转换
zh_hant: 已完成 PdfToText 轉換

# AgentVerboseWebSearchOnly
source: Completed web search
ja_jp: ウェブ検索を完了しました
zh_hans: 已完成网页搜索
zh_hant: 已完成網頁搜尋

# AgentVerboseWebFetchOnly
source: Read web page content
ja_jp: ウェブページを読み込みました
zh_hans: 已读取网页
zh_hant: 已讀取網頁

# AgentVerboseSaveTabOnly
source: Saved tab
ja_jp: タブを保存しました
zh_hans: 已保存标签页
zh_hant: 已儲存分頁

# AgentVerboseEditTabOnly
source: Edited tab
ja_jp: タブの内容を編集しました
zh_hans: 已编辑标签页内容
zh_hant: 已編輯分頁內容

# AgentVerboseOpenFileOnly
source: Opened file
ja_jp: ファイルを開きました
zh_hans: 已打开文件
zh_hant: 已開啟檔案

# AgentVerboseOpenFileExistingOnly
source: Activated already-open file
ja_jp: すでに開いているファイルをアクティブにしました
zh_hans: 已激活已打开的文件
zh_hant: 已啟用已開啟的檔案

# AgentModifiedFilesHeader
source: Modified Files (Click to compare)
ja_jp: 変更済み (クリックで比較)
zh_hans: 修改文件（点击比较）
zh_hant: 修改文件（點擊比較）

# AgentModifiedFilesDescription
source: List of modified files. Click the right icon to revert.
ja_jp: 変更されたファイルの一覧です。元に戻すには右のアイコンをクリックしてください。
zh_hans: 已修改文件的列表。单击右侧图标即可恢复。
zh_hant: 已修改文件的清單。點擊右側圖示即可恢復。

# AgentActivityFileReverted
source: Reverted file changes: {0}
ja_jp: ファイルの変更を元に戻しました: {0}
zh_hans: 恢复的文件更改：{0}
zh_hant: 恢復的檔案變更：{0}

# AgentFileEditAlreadyComplete
source: The requested task has been completed.
ja_jp: 要求された作業を完了しました。
zh_hans: 请求的任务已完成。
zh_hant: 請求的任務已完成。

# AgentRevertErrorTitle
source: Revert Error
ja_jp: 元に戻すエラー
zh_hans: 恢复错误
zh_hant: 恢復錯誤

# AgentRevertErrorFormat
source: An error occurred while reverting the file: {0}
ja_jp: ファイルを元に戻す際にエラーが発生しました: {0}
zh_hans: 恢复文件时出错：{0}
zh_hant: 恢復檔案時發生錯誤：{0}

# AgentSessionRewindErrorTitle
source: Session Rewind Error
ja_jp: セッション巻き戻しエラー
zh_hans: 会话倒带错误
zh_hant: 會話倒帶錯誤

# AgentSessionRewindErrorFormat
source: An error occurred while rewinding the session: {0}
ja_jp: セッションの巻き戻し中にエラーが発生しました: {0}
zh_hans: 回滚会话时发生错误：{0}
zh_hant: 回滾會話時發生錯誤：{0}

# AgentDiffTitle
source: Agent Change Compare
ja_jp: Agent 変更比較
zh_hans: Agent 更改比较
zh_hant: Agent 更改比較

# DiffOriginalLabel
source: Original
ja_jp: オリジナル
zh_hans: 原创
zh_hant: 原創

# DiffModifiedLabel
source: Modified
ja_jp: 修正版
zh_hans: 修改
zh_hant: 修改

# AgentModifiedFilesCloseTooltip
source: Close list
ja_jp: リストを閉じる
zh_hans: 关闭列表
zh_hant: 關閉清單

# AgentAddAttachmentTooltip
source: Add image or file
ja_jp: 画像またはファイルを追加
zh_hans: 添加图像或文件
zh_hant: 新增圖像或文件

# AgentRemoveAttachmentTooltip
source: Remove attachment
ja_jp: 添付を削除
zh_hans: 删除附件
zh_hant: 刪除附件

# AgentAttachmentErrorTitle
source: Attachment Error
ja_jp: 添付追加エラー
zh_hans: 附件错误
zh_hant: 附件錯誤

# AgentAttachmentErrorFormat
source: An error occurred while adding the attachment: {0}
ja_jp: 添付の追加中にエラーが発生しました: {0}
zh_hans: 添加附件时出错：{0}
zh_hant: 新增附件時發生錯誤：{0}

# AgentPdfAttachmentExcluded
source: PDF files are not included as attachments.
ja_jp: PDF ファイルは添付に含まれません。
zh_hans: PDF 文件不作为附件包含在内。
zh_hant: PDF 檔案不作為附件包含在內。
